#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_subnets.selected: Reading...[0m[0m
[0m[1maws_security_group.ga_lb_sg: Refreshing state... [id=sg-0ed2efdebd255bf14][0m
[0m[1maws_security_group.ga_app_sg: Refreshing state... [id=sg-074b1768acf554503][0m
[0m[1maws_security_group.ga_db_sg: Refreshing state... [id=sg-00ed92986f2772a1d][0m
[0m[1maws_security_group_rule.allow_internet: Refreshing state... [id=sgrule-1522206696][0m
[0m[1maws_security_group_rule.allow_tcp_443: Refreshing state... [id=sgrule-2372193134][0m
[0m[1maws_security_group_rule.allow_tcp_3306: Refreshing state... [id=sgrule-3017359774][0m
[0m[1mdata.aws_subnets.selected: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_db_subnet_group.data: Refreshing state... [id=ga-db-issue-6-subnet-group][0m
[0m[1maws_db_instance.ga_mysql: Refreshing state... [id=db-QREQBO7OJ2BNPMGOR3SKSRPEVQ][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_efs_access_point.ga_ap_root[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_root" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "GA-root-issue-6-ap"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_file_system.ga_efs[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_file_system" "ga_efs" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m availability_zone_id    = (known after apply)
      [32m+[0m[0m availability_zone_name  = (known after apply)
      [32m+[0m[0m creation_token          = (sensitive value)
      [32m+[0m[0m dns_name                = (known after apply)
      [32m+[0m[0m encrypted               = true
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m kms_key_id              = (known after apply)
      [32m+[0m[0m name                    = (known after apply)
      [32m+[0m[0m number_of_mount_targets = (known after apply)
      [32m+[0m[0m owner_id                = (known after apply)
      [32m+[0m[0m performance_mode        = (known after apply)
      [32m+[0m[0m size_in_bytes           = (known after apply)
      [32m+[0m[0m tags_all                = (known after apply)
      [32m+[0m[0m throughput_mode         = "bursting"
    }

[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mathieupetersonGC, Action: `pull_request`*